<template>
    <div>
        <h1>数据结构和算法模块</h1>
        <p>数据结构（英语：data structure）是计算机中存储、组织数据的方式。</p>
        <p>
            数据结构是一种具有一定逻辑关系，在计算机中应用某种存储结构，并且封装了相应操作的数据元素集合。它包含三方面的内容，逻辑关系、存储关系及操作。
        </p>
        <p>
            不同种类的数据结构适合于不同种类的应用，而部分甚至专门用于特定的作业任务。例如，计算机网络依赖于路由表运作，B
            树高度适用于数据库的封装。
        </p>
        <h1>为什么要学习数据结构和算法？</h1>
        <p>
            随着应用程序变得越来越复杂和数据越来越丰富，几百万、几十亿甚至几百亿的数据就会出现，而对这么大对数据进行搜索、插入或者排序等的操作就越来越慢，数据结构就是用来解决这些问题的。
        </p>
        <h1>常见的数据结构</h1>
        <ul>
            <li>栈（Stack）：栈是一种特殊的线性表，它只能在一个表的一个固定端进行数据结点的插入和删除操作。</li>
            <li>
                队列（Queue）：队列和栈类似，也是一种特殊的线性表。和栈不同的是，队列只允许在表的一端进行插入操作，而在另一端进行删除操作。
            </li>
            <li>数组（Array）：数组是一种聚合数据类型，它是将具有相同类型的若干变量有序地组织在一起的集合。</li>
            <li>
                链表（Linked
                List）：链表是一种数据元素按照链式存储结构进行存储的数据结构，这种存储结构具有在物理上存在非连续的特点。
            </li>
            <li>树（Tree）：树是典型的非线性结构，它是包括，2 个结点的有穷集合 K。</li>
            <li>图（Graph）：图是另一种非线性数据结构。在图结构中，数据结点一般称为顶点，而边是顶点的有序偶对。</li>
            <li>堆（Heap）：堆是一种特殊的树形数据结构，一般讨论的堆都是二叉堆。</li>
            <li>
                散列表（Hash table）：散列表源自于散列函数(Hash
                function)，其思想是如果在结构中存在关键字和T相等的记录，那么必定在F(T)的存储位置可以找到该记录，这样就可以不用进行比较操作而直接取得所查记录。
            </li>
        </ul>
    </div>
</template>

<script>
export default {}
</script>

<style lang="scss" scoped></style>
